src/cf/InformationRegisters/УС_ВходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УС_ВходящиеСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УС_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УС_ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/УС_СтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>УС_СтатусыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/УС_ВходящиеСообщения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

Процедура ЗаписатьСообщение(СтруктураСообщения) Экспорт
	
	мз = РегистрыСведений.УС_ВходящиеСообщения.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(мз, СтруктураСообщения);
	
	мз.Статус = Перечисления.УС_СтатусыСообщений.Новое;
	
	мз.Записать();
		
КонецПроцедуры	


Процедура УстановитьСтатусСообщения(ИдентификаторСообщения, Статус, Ошибка = Неопределено) Экспорт
	
	мз = РегистрыСведений.УС_ВходящиеСообщения.СоздатьМенеджерЗаписи();
	мз.ИдентификаторСообщения = ИдентификаторСообщения;
	
	мз.Прочитать();
	
	Если мз.Выбран() Тогда
		
		мз.Статус = Статус; 
		мз.Ошибка = Ошибка;
		мз.Записать();
		
	КонецЕсли;			
	
КонецПроцедуры


Функция ПолучитьСообщенияКОбработке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсходящиеСообщения.ИдентификаторСообщения КАК ИдентификаторСообщения,
	               |	ИсходящиеСообщения.ТелоСообщения КАК ТелоСообщения,
	               |	ИсходящиеСообщения.Статус КАК Статус,
	               |	ИсходящиеСообщения.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	               |	ИсходящиеСообщения.ТипСообщения КАК ТипСообщения
	               |ИЗ
	               |	РегистрСведений.УС_ВходящиеСообщения КАК ИсходящиеСообщения
	               |ГДЕ
	               |	ИсходящиеСообщения.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.УС_СтатусыСообщений.Новое);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции



#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
